13xforever.language-x86-64-assembly
docker.docker
github.copilot
github.copilot-chat
github.vscode-github-actions
humao.rest-client
james-yu.latex-workshop
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mikoz.black-py
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
njpwerner.autodocstring
quarto.quarto
redhat.java
tomoki1207.pdf
vscodevim.vim
